tutorials/immersedBoundary/CylinderInChannelIco/Turbulent/Turbulent/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ibCylinder
    {
        type            immersedBoundaryNutWallFunction;
        patchType       immersedBoundary;
        setDeadValue    true;
        deadValue       1e-5;
        value           uniform 0;
    }
    ibCylinder2
    {
        type            immersedBoundaryNutWallFunction;
        patchType       immersedBoundary;
        setDeadValue    true;
        deadValue       1e-5;
        value           uniform 0;
    }
    top
    {
        type            zeroGradient;
        value           uniform 0;
    }
    in
    {
        type            zeroGradient;
        value           uniform 0;
    }
    out
    {
        type            zeroGradient;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
